package cn.com.jansh.constant;

import com.jansh.core.exception.ErrorCode;

public enum AppErrorCode implements ErrorCode {
		/**
	 * 用户名已存在
	 */
	E280001("280001"),	
	/**
	 * 用户不存在
	 */
	E280002("280002"),
	/**
	 * 手机号已存在
	 */
	E280003("280003"),
	/**
	 * 邮箱已存在
	 */
	E280004("280004"),
	
	/**
	 * 机构未启用!
	 */
	E200008("200008"),
	
	/**
	 * 新密码与旧密码不能相同，请重新输入!
	 */
	E200007("200007"),
	/**
	 * 密码不能为空
	 */
	E200006("200006"),
	/**
	 * 密码错误次数已超限，请联系管理员进行密码重置
	 */
	E200005("200005"),
	/**
	 * 原密码输入错误
	 */
	E200004("200004"),
	/**
	 * 两次新密码输入不一致
	 */
	E200003("200003"),
	/**
	 * 该角色正在使用，无法删除
	 */
	E200002("200002"),
	/**
	 * 角色名已存在
	 */
	E200001("200001"),
	/**
	 * 新增数据异常
	 */
	E120001("120001"),
	/**
	 * 删除数据异常
	 */
	E120002("120002"),
	/**
	 * 修改数据异常
	 */
	E120003("120003"),
	/**
	 * 查询数据异常
	 */
	E120004("120004"),

	/**
	 * 系统忙，请稍后再试
	 */
	E120000("120000"),	
	/**
	 * 网络异常，请稍后再试
	 */
	E200000("200000"),	
	/**
	 * 票据解析异常
	 */
	E210000("210000"),	
	/**
	 * 验证码错误
	 */
	E200010("200010"),
	/**
	 * 验证码超时
	 */
	E200020("200020"),
	/**
	 * 未获取验证码
	 */
	E200030("200030"),
	
	/**
	 * 图片格式错误
	 */
	E200100("200100"),
	/**
	 * 图片太大
	 */
	E200200("200200"),
	/**
	 * 图片上传异常
	 */
	E200300("200300"),	
	/**
	 * 图片目录生成失败
	 */
	E200400("200400");
	/* ======================================= */
	private final String value;

	private AppErrorCode(String value) {
		this.value = value;
	}

	public String value() {
		return this.value;
	}
}
